flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_beacon/main.c
	p_data = p_advdata->p_data;
	
	while(index < p_advdata->data_len)
	{
		uint8_t field_length = p_data[index];
		uint8_t field_type = p_data[index+1];
		
		if(field_type == type)
		{
			p_typedata->p_data = &p_data[index + 2];
			p_typedata->data_len = field_length - 1;
			return NRF_SUCCESS;
		}
		index += field_length + 1;
	}
	
	return NRF_ERROR_NOT_FOUND;
}

#define BLE_UUID_NUS_SERVICE  0x0001 
#define NUS_SERVICE_UUID_TYPE 0x02
#define NUS_BASE_UUID                  {{0x9E, 0xCA, 0xDC, 0x24, 0x0E, 0xE5, 0xA9, 0xE0, 0x93, 0xF3, 0xA3, 0xB5, 0x00, 0x00, 0x40, 0x6E}} /**< Used vendor specific UUID. */
//static ble_uuid_t find_uuids[] = {{BLE_UUID_NUS_SERVICE, BLE_UUID_TYPE_BLE}};
#define BLE_UUID_DEVICE_TEST_SERVICE 0xFFA1
static ble_uuid_t find_uuids[] = {{BLE_UUID_DEVICE_TEST_SERVICE, BLE_UUID_TYPE_BLE}};

#define UUID16_SIZE             2                               /**< Size of 16 bit UUID */
#define UUID32_SIZE             4                               /**< Size of 32 bit UUID */
#define UUID128_SIZE            16                              /**< Size of 128 bit UUID */

static bool is_uuid_present(const ble_uuid_t *p_target_uuid,
                            const ble_gap_evt_adv_report_t *p_adv_report)
{
    uint32_t err_code;
    uint32_t index = 0;
    uint8_t *p_data = (uint8_t *)p_adv_report->data;
    ble_uuid_t extracted_uuid;

    while (index < p_adv_report->dlen)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index + 1];
        if ( (field_type == BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE)
           || (field_type == BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE)
           )
        {
            for (uint32_t u_index = 0; u_index < (field_length / UUID16_SIZE); u_index++)
            {
                err_code = sd_ble_uuid_decode(  UUID16_SIZE,
                                                &p_data[u_index * UUID16_SIZE + index + 2],
                                                &extracted_uuid);
                if (err_code == NRF_SUCCESS)
                {
                    if ((extracted_uuid.uuid == p_target_uuid->uuid)
                        && (extracted_uuid.type == p_target_uuid->type))
                    {
                        return true;
                    }
                }
            }
        }

        else if ( (field_type == BLE_GAP_AD_TYPE_32BIT_SERVICE_UUID_MORE_AVAILABLE)
                || (field_type == BLE_GAP_AD_TYPE_32BIT_SERVICE_UUID_COMPLETE)
                )
        {
            for (uint32_t u_index = 0; u_index < (field_length / UUID32_SIZE); u_index++)
            {
                err_code = sd_ble_uuid_decode(UUID16_SIZE,
                &p_data[u_index * UUID32_SIZE + index + 2],
                &extracted_uuid);
                if (err_code == NRF_SUCCESS)
                {
                    if ((extracted_uuid.uuid == p_target_uuid->uuid)
                        && (extracted_uuid.type == p_target_uuid->type))
                    {
                        return true;
                    }
                }
            }
        }

        else if ( (field_type == BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_MORE_AVAILABLE)
                || (field_type == BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_COMPLETE)
                )
        {
            err_code = sd_ble_uuid_decode(UUID128_SIZE,
                                          &p_data[index + 2],
                                          &extracted_uuid);
            if (err_code == NRF_SUCCESS)
            {
								printf("%x\r\n",extracted_uuid.uuid);
                if ((extracted_uuid.uuid == p_target_uuid->uuid)
                    && (extracted_uuid.type == p_target_uuid->type))
                {
                    return true;
                }
            }
        }
        index += field_length + 1;
    }
    return false;
}

static bool find_adv_name(const ble_gap_evt_adv_report_t *p_adv_report, const char *name_to_find)
{
	uint32_t err_code;
	data_t adv_data;
	data_t dev_name;
	
	adv_data.p_data = (uint8_t *)p_adv_report->data;
	adv_data.data_len = p_adv_report->dlen;
	
	err_code = adv_report_parse(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME,
															&adv_data,
															&dev_name);
	
	if(err_code == NRF_SUCCESS)
	{
		if(memcmp(name_to_find, dev_name.p_data, dev_name.data_len) == 0)
		{
			return true;
		}
	}
	else
	{
		err_code = adv_report_parse(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME,
															&adv_data,
															&dev_name);
		
		if(err_code != NRF_SUCCESS)
		{
			return false;
		}
		if(memcmp(m_target_periph_name, dev_name.p_data, dev_name.data_len) == 0)
		{
			return true;
		}
	}
	return false;
}

#define UUID16_EXTRACT(DST,SRC) \
		do													\
		{														\
			(*(DST)) = (SRC)[1];			\
			(*(DST)) << 8;						\
			(*(DST)) |= (SRC)[0];			\
		}while(0)
		
#define TARGET_UUID 0x1800
		
		#if 0
static bool find_adv_uuid(const ble_gap_evt_adv_report_t *p_adv_report, const uint16_t uuid_to_find)
{
	uint32_t err_code;
	data_t adv_data;
	data_t type_data;
	
	adv_data.p_data = (uint8_t *)p_adv_report->data;
	adv_data.data_len = p_adv_report->dlen;
	
	err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE,
															&adv_data,
															&type_data);
	
	if(err_code != NRF_SUCCESS)
	{
		err_code =	adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE,
															&adv_data,
															&type_data); 
		
		if(err_code != NRF_SUCCESS)
		{
			printf("return error\r\n");
			return false;
		}
	}
	
	for(uint32_t u_index = 0; u_index < (type_data.data_len / sizeof(uint16_t)); u_index++)
	{
		uint16_t extracted_uuid;
		
		UUID16_EXTRACT(&extracted_uuid, &type_data.p_data[u_index * sizeof(uint16_t)]);
		printf("0x%x\r\n",extracted_uuid);
		if(extracted_uuid == uuid_to_find)
		{
			return true;
		}
	}
	
	return false;
	
}
#endif

static void on_ble_evt(ble_evt_t * p_ble_evt)
{
		//uint32_t err_code = NRF_SUCCESS;
		const ble_gap_evt_t * p_gap_evt = &p_ble_evt->evt.gap_evt;
	
		switch (p_ble_evt->header.evt_id)
		{
			case BLE_GAP_EVT_ADV_REPORT:
			{
				const ble_gap_evt_adv_report_t * p_adv_report = &p_gap_evt->params.adv_report;
				if(strlen(m_target_periph_name) != 0)
				{
					if(find_adv_name(&p_gap_evt->params.adv_report, m_target_periph_name))
					{
						printf("find the match send connect_request!!\r\n");
						(void)sd_ble_gap_scan_stop();
					}
				}
				else
				{
					if (is_uuid_present(find_uuids, p_adv_report))
					{
							rssi_status = 1;
							ble_rssi = p_adv_report->rssi;
							//printf("uuid mach!!\r\n");
					}

