flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_beacon/main.c
				}
			}break;
		}
}

static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{

    on_ble_evt(p_ble_evt);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);
	
	    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for doing power management.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief ADC interrupt handler.
 */
static void adc_event_handler(nrf_drv_adc_evt_t const * p_event)
{
		uint16_t        batt_lvl_in_milli_volts;
		nrf_adc_value_t adc_result;
	
    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
    {
				uint32_t i;
				for (i = 0; i < p_event->data.done.size; i++)
				{
						adc_result = p_event->data.done.p_buffer[i];
						if(0 == (i % number_of_adc_channels)){
							batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(adc_result);
							batt_lvl_in_milli_volts = batt_lvl_in_milli_volts * 122 / 22;
							//NRF_LOG_INFO("main batter %d\r\n",batt_lvl_in_milli_volts);
							adc_data.adc1 = batt_lvl_in_milli_volts;
//							if(batt_lvl_in_milli_volts < 2500){
//								app_timer_stop(led_on_timer_id);
//								nrf_gpio_pin_write(20,0);
//							}
//							else if(batt_lvl_in_milli_volts > 2600){
//								app_timer_start(led_on_timer_id, LED_ON_TIMER_INTERVAL, NULL);
//								nrf_gpio_pin_write(20,1);
//							}
						}else if(1 == (i % number_of_adc_channels)){
							batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(adc_result);
							batt_lvl_in_milli_volts = batt_lvl_in_milli_volts * 122 / 22;
							//NRF_LOG_INFO("sub batter %d\r\n",batt_lvl_in_milli_volts);
							adc_data.adc2 = batt_lvl_in_milli_volts;
						}else if(2 == (i % number_of_adc_channels)){
							batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(adc_result);
							batt_lvl_in_milli_volts = batt_lvl_in_milli_volts *3;
							//NRF_LOG_INFO("system batter %d\r\n",batt_lvl_in_milli_volts);
							adc_data.adc3 = batt_lvl_in_milli_volts;
						}
						
				}
        APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));
    }

}

/**
 * @brief ADC initialization.
 */
static void adc_config(void)
{
    ret_code_t ret_code;
	
    //Initialize ADC
    nrf_drv_adc_config_t config = NRF_DRV_ADC_DEFAULT_CONFIG;
    ret_code = nrf_drv_adc_init(&config, adc_event_handler);
    APP_ERROR_CHECK(ret_code);
	
    //Configure and enable ADC channel 0
    static nrf_drv_adc_channel_t m_channel_0_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_7); 
    m_channel_0_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_FULL_SCALE;
    nrf_drv_adc_channel_enable(&m_channel_0_config);
	
    //Configure and enable ADC channel 1
    static nrf_drv_adc_channel_t m_channel_1_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_6); 
    m_channel_1_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_FULL_SCALE;
    nrf_drv_adc_channel_enable(&m_channel_1_config);
	
    //Configure and enable ADC channel 2
    static nrf_drv_adc_channel_t m_channel_2_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_DISABLED);	
    m_channel_2_config.config.config.input = NRF_ADC_CONFIG_SCALING_SUPPLY_ONE_THIRD;
    nrf_drv_adc_channel_enable(&m_channel_2_config);
	
    number_of_adc_channels = 3;    //Set equal to the number of configured ADC channels, for the sake of UART output.
		APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));

}


static void battery_timerout_handler(void * p_context)
{
    nrf_drv_adc_sample();
}

static void led_off_timerout_handler(void * p_context)
{
		//	app_timer_stop(led_on_timer_id);
			app_timer_stop(led_off_timer_id);
}

static void led_timerout_handler(void * p_context)
{
			nrf_gpio_pin_write(LED_PIN,1);
			nrf_delay_ms(200);
			nrf_gpio_pin_write(LED_PIN,0);
//		if(nrf_gpio_pin_read(21) == 1){
//			 app_timer_stop(led_on_timer_id);
//			 app_timer_start(led_off_timer_id, LED_OFF_TIMER_INTERVAL, NULL);
//		}else{
//			 app_timer_stop(led_off_timer_id);
//			 app_timer_start(led_on_timer_id, LED_ON_TIMER_INTERVAL, NULL);
//		}
//    nrf_gpio_pin_toggle(LED_PIN);
		
}



static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
    err_code = app_timer_create(&battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_timerout_handler);
    APP_ERROR_CHECK(err_code);
	
	  err_code = app_timer_create(&led_on_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                led_timerout_handler);
    APP_ERROR_CHECK(err_code);
	
		err_code = app_timer_create(&led_off_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                led_off_timerout_handler);
    APP_ERROR_CHECK(err_code);
	
		err_code = app_timer_create(&uart_timer_id,
														APP_TIMER_MODE_REPEATED,
														uart_timeout_handler);
		APP_ERROR_CHECK(err_code);
}

static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(battery_timer_id, BATTER_TIMER_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
	
//	  err_code = app_timer_start(led_on_timer_id, LED_ON_TIMER_INTERVAL, NULL);
//    APP_ERROR_CHECK(err_code);
//	
//		err_code = app_timer_start(led_off_timer_id, LED_OFF_TIMER_INTERVAL, NULL);
//    APP_ERROR_CHECK(err_code);
}


static volatile bool ready_flag;            // A flag indicating PWM status.

void pwm_ready_callback(uint32_t pwm_id)    // PWM callback function
{
    ready_flag = true;
}
typedef struct 
{
	short  position;
	short  length;
	char   character[128];
} custom_cmdLine;

