flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_beacon/main.c
typedef enum
{
	CUSTOM_RSP_ERROR = -1,
	CUSTOM_RSP_OK = 0,
	CUSTOM_RSP_LATER
} custom_rsp_type_enum;

typedef struct
{
	char *commandString;
	custom_rsp_type_enum (*commandFunc)(custom_cmdLine *commandBuffer_p);
} custom_atcmd;

typedef enum
{
	CUSTOM_WRONG_MODE,
	CUSTOM_SET_OR_EXECUTE_MODE,
	CUSTOM_READ_MODE,
	CUSTOM_TEST_MODE,
	CUSTOM_ACTIVE_MODE
} custom_cmd_mode_enum;

typedef struct
{
	short  position;
	uint8_t   	 part;
	char     	 	 rcv_msg[128];
	char       	 *pars[10];
	uint16_t      rcv_length;
} cmd_data_struct;

typedef enum
{
    CM_Main,
    CM_Par1,
    CM_Par2,
    CM_Par3,
    CM_Par4,
    CM_Par5,
    CM_Par6,
    CM_Par7,
    CM_Par8,
    CMD_MAX_Pars
} Cmd_Pars;


custom_cmd_mode_enum custom_find_cmd_mode(custom_cmdLine *cmd_line)
{
    custom_cmd_mode_enum result;
   // if (cmd_line->position < cmd_line->length - 1) //modfiy by xuzhoubin for no '\r\n'
		if (cmd_line->position < cmd_line->length)
    {
        switch (cmd_line->character[cmd_line->position])
        {
            case '?':  /* AT+...? */
            {
                cmd_line->position++;
                result = CUSTOM_READ_MODE;
                break;
            }
            case '=':  /* AT+...= */
            {
                cmd_line->position++;								
                if ((cmd_line->position < cmd_line->length ) &&
                    (cmd_line->character[cmd_line->position] == '?'))
                {
                    cmd_line->position++;
                    result = CUSTOM_TEST_MODE;
                }
                else
                {
                    result = CUSTOM_SET_OR_EXECUTE_MODE;
                }
                break;
            }
            default:  /* AT+... */
            {
                result = CUSTOM_ACTIVE_MODE;
                break;
            }
        }
    }
    else
    {
        result = CUSTOM_ACTIVE_MODE;
    }
    return (result);
}

static int fun_str_analyse(char *str_data, char **tar_data, int limit, char startChar, char *endChars, char splitChar)
{
    static char *blank = "";
    int len, i = 0, j = 0, status = 0;
    char *p;
    if(str_data == NULL || tar_data == NULL)
    {
        return -1;
    }
    len = strlen(str_data);
	
		if(str_data[len - 1]  == '\n')  //add by xuzhoubin for have  \r\n,数据解析error
				len -=2;
	
    for(i = 0, j = 0, p = str_data; i < len; i++, p++)
    {
        if(status == 0 && (*p == startChar || startChar == NULL))
        {
            status = 1;
            if(j >= limit)
            {
                return -2;
            }
            if((startChar == NULL))
            {
                tar_data[j++] = p;
            }
            else if(*(p + 1) == splitChar)
            {
                tar_data[j++] = blank;
            }
            else
            {
                tar_data[j++] = p + 1;
            }
        }
        if(status == 0)
        {
            continue;
        }
        if(strchr(endChars, *p) != NULL)
        {
            *p = 0;
            break;
        }
        if(*p == splitChar)
        {
            *p = 0;
            if(j >= limit)
            {
                return -3;
            }
            if(strchr(endChars, *(p + 1)) != NULL || *(p + 1) == splitChar)
            {
                tar_data[j++] = blank;
            }
            else
            {
                tar_data[j++] = p + 1;
            }
        }
    }
    for(i = j; i < limit; i++)
    {
        tar_data[i] = blank;
    }
    return j;
}

static int cmd_analyse(cmd_data_struct * command)
{
	char        *data_ptr, split_ch = ',';
	int         cmd_Len, par_len;
	
	
	if(command == NULL || command->rcv_length < 1)
  {
        return -1;
  }
	//fun_toUpper(command->rcv_msg);
	data_ptr = &command->rcv_msg[command->position];//parse_sms_head(command->rcv_msg); 
	
	cmd_Len = strlen(data_ptr);
	

    if(data_ptr[cmd_Len - 3] == '#' && data_ptr[cmd_Len - 2] == 0x0D && data_ptr[cmd_Len - 1] == 0x0A)
    {
        data_ptr[cmd_Len - 3] = 0;
    }
    else if(data_ptr[cmd_Len - 2] == '#' && data_ptr[cmd_Len - 1] == 0x0D)
    {
        data_ptr[cmd_Len - 2] = 0;
    }
    else if(data_ptr[cmd_Len - 1] == '#')
    {
        data_ptr[cmd_Len - 1] = 0;
    }
			
		par_len = fun_str_analyse(data_ptr, command->pars, 10, NULL, "\r\n", split_ch);

    if(par_len > 10 || par_len <= 0)
    {
        return -1;
    }
		
		if(par_len > 10 || par_len <= 0)
    {
        return -1;
    }
		
		if((par_len - CM_Main) > 0)
    {
        command->part = par_len - CM_Main;
    }
    else
    {
        command->part = 0;
    }	

	return 1;
}

cmd_data_struct at_get_at_para(custom_cmdLine *commandBuffer_p)
{
		static cmd_data_struct at_cmd = {0};
		if(commandBuffer_p->length && (commandBuffer_p->length <128))
		{
			memset(&at_cmd, 0, sizeof(cmd_data_struct)); 
			memcpy(&at_cmd.rcv_msg, commandBuffer_p->character, commandBuffer_p->length);	

			at_cmd.rcv_length = commandBuffer_p->length;
			at_cmd.position   = commandBuffer_p->position;
			
			cmd_analyse(&at_cmd);
		}
		return at_cmd;
}

static custom_rsp_type_enum custom_test_func(custom_cmdLine *commandBuffer_p)
{
	printf("\r\nOK\r\n");
	return  CUSTOM_RSP_OK;
}

static custom_rsp_type_enum custom_readadc_func(custom_cmdLine *commandBuffer_p)
{
	printf("+MADC:%d,%d,%d\r\n",adc_data.adc1,adc_data.adc2,adc_data.adc3);
	return  CUSTOM_RSP_OK;	
}

static custom_rsp_type_enum custom_power_switch_func(custom_cmdLine *commandBuffer_p)
{
	custom_cmd_mode_enum result;
	custom_rsp_type_enum ret_value  = CUSTOM_RSP_ERROR;
	result = custom_find_cmd_mode(commandBuffer_p);
	cmd_data_struct cmd = at_get_at_para(commandBuffer_p);
	if(cmd.part != 1)
		return CUSTOM_RSP_ERROR;
	
	char* data = cmd.pars[0];
	
	int8_t ret = atoi(&data[0]);
	
		switch (ret){
			case 0:
				nrf_gpio_pin_write(20,0);  //切换到副电
				ret_value = CUSTOM_RSP_OK;
				break;
			case 1:
				nrf_gpio_pin_write(20,1);  //切换到主电
				ret_value = CUSTOM_RSP_OK; 
				break;
			default:
				ret_value = CUSTOM_RSP_ERROR;
				break;
		}
		printf("+POWSWITCH:%d\r\n",ret);
	return  ret_value;
}


