flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_beacon/main.c
static custom_rsp_type_enum custom_led_func(custom_cmdLine *commandBuffer_p)
{
	custom_cmd_mode_enum result;
	custom_rsp_type_enum ret_value  = CUSTOM_RSP_ERROR;
	result = custom_find_cmd_mode(commandBuffer_p);
	cmd_data_struct cmd = at_get_at_para(commandBuffer_p);
	if(cmd.part != 1)
		return CUSTOM_RSP_ERROR;
	
	char* data = cmd.pars[0];
	
	int8_t ret = atoi(&data[0]);
	
		switch (ret){
			case 0:
				nrf_gpio_pin_write(LED_PIN,0);  //LED灯灭
				ret_value = CUSTOM_RSP_OK;
				break;
			case 1:
				nrf_gpio_pin_write(LED_PIN,1);  //LED灯亮
				ret_value = CUSTOM_RSP_OK; 
				break;
			default:
				ret_value = CUSTOM_RSP_ERROR;
				break;
		}
		printf("+MLED:%d\r\n",ret);
	return  ret_value;
}

static custom_rsp_type_enum custom_rrssi_func(custom_cmdLine *commandBuffer_p)
{
	custom_rsp_type_enum ret_value  = CUSTOM_RSP_ERROR;
	if(1 == rssi_status)
		printf("+RSSI:%d\r\n",ble_rssi);
	else
		printf("+RSSI:NULL\r\n");
	rssi_status = 0;
	return  ret_value;
}

const custom_atcmd custom_cmd_table[ ] =
{   
	{"AT",custom_test_func},	
	{"AT+MADC",custom_readadc_func},
	{"AT+POWSWITCH",custom_power_switch_func},
	{"AT+MLED",custom_led_func},
	{"AT+MRSSI",custom_rrssi_func},
	//{"AT+MSENSOR",custom_sensor_func},
  {NULL, NULL}  // this lind should not be removed, it will be treat as 
};

static bool uart_custom_common_hdlr(char *full_cmd_string)
{
	char buffer[128];
	char *cmd_name, *cmdString;
	uint8_t index = 0; 
	uint16_t length;
	uint16_t i;
	custom_cmdLine command_line;
	cmd_name = buffer;
	length = strlen(full_cmd_string);
	length = length > 127 ? 127 : length;  

	while ((full_cmd_string[index] != '=' ) &&  //might be TEST command or EXE command
				(full_cmd_string[index] != '?' ) && // might be READ command
			(full_cmd_string[index] != 13 ) &&    //carriage return
			(full_cmd_string[index] != 10) && 
	index < length)  
	{
		cmd_name[index] = full_cmd_string[index] ;
		index ++;
	}
	cmd_name[index] = '\0' ;   
	
    for (i = 0 ; custom_cmd_table[i].commandString != NULL; i++ )
    {
        cmdString = custom_cmd_table[i].commandString;
        if (strcmp(cmd_name, cmdString) == 0 )
        {
            strncpy(command_line.character, full_cmd_string, 128);
            command_line.character[127] = '\0';
            command_line.length = strlen(command_line.character);
            command_line.position = index;
						custom_cmd_table[i].commandFunc(&command_line);
//            if (custom_cmd_table[i].commandFunc(&command_line) == CUSTOM_RSP_OK) {
//								printf("\r\nOK\r\n");
//						}else{
//								printf("\r\nERROR\r\n");
//            }
            return true;
        }
    }   
			
		return true;
}

static void uart_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
		app_timer_stop(uart_timer_id);
		uart_custom_common_hdlr((char *)data_array);
		memset(data_array, 0, UART_BUFFER_SIZE);
		timer_start = 0;
		index = 0;
}
//static uint8_t uart_event = 0;

static void scheduler_handler(void *p_event_data, uint16_t event_size)
{
	//printf("scheduler_handler\r\n");
	UNUSED_PARAMETER(p_event_data);
	UNUSED_PARAMETER(event_size);
	UNUSED_VARIABLE(app_uart_get(&data_array[index]));
}

static void uart_event_handle(app_uart_evt_t * p_event)
{
	switch (p_event->evt_type)
	{
				case APP_UART_DATA_READY:
							//app_sched_event_put(NULL, 0, scheduler_handler);
							//uart_event = 1;
						UNUSED_VARIABLE(app_uart_get(&data_array[index]));
						//printf("%s\r\n",data_array);
						index++;
				
						if(timer_start == 0){
							app_timer_start(uart_timer_id, UART_IMTES_INTERVAL, NULL);
							timer_start = 1;
						}		
						
						if((index >= (UART_BUFFER_SIZE)))
						{
							memset(data_array, 0, UART_BUFFER_SIZE);
							index = 0;
						} 
						
						if((data_array[index - 1] == '\n') && (timer_start == 1)){
							app_timer_stop(uart_timer_id);
							uart_custom_common_hdlr((char *)data_array);
							
							memset(data_array, 0, UART_BUFFER_SIZE);
							index = 0;
							timer_start = 0;
						}
				
						break;
	      case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
	
	}
}

void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}

#define SCAN_INTERVAL           0x00A0                          /**< Determines scan interval in units of 0.625 millisecond. */
#define SCAN_WINDOW             0x0050                          /**< Determines scan window in units of 0.625 millisecond. */
#define SCAN_ACTIVE             1                               /**< If 1, performe active scanning (scan requests). */
#define SCAN_SELECTIVE          0                               /**< If 1, ignore unknown devices (non whitelisted). */
#define SCAN_TIMEOUT            0x0000                          /**< Timout when scanning. 0x0000 disables timeout. */


static const ble_gap_scan_params_t m_scan_params =
{
    .active   = 1,
    .interval = SCAN_INTERVAL,
    .window   = SCAN_WINDOW,
    .timeout  = SCAN_TIMEOUT,
    #if (NRF_SD_BLE_API_VERSION == 2)
        .selective   = 0,
        .p_whitelist = NULL,
    #endif
    #if (NRF_SD_BLE_API_VERSION == 3)
        .use_whitelist = 0,
    #endif
};

static void scan_start(void)
{
    ret_code_t ret;

    ret = sd_ble_gap_scan_start(&m_scan_params);
    APP_ERROR_CHECK(ret);

    ret = bsp_indication_set(BSP_INDICATE_SCANNING);
    APP_ERROR_CHECK(ret);
}

#define SCHED_MAX_EVENT_DATA_SIZE 						MAX(APP_TIMER_SCHED_EVT_SIZE, 0)
#define SCHED_QUEUE_SIZE                      20

static void scheduler_init(void)
{
	APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/**
 * @brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    //APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    //err_code = bsp_init(BSP_INIT_LED, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), NULL);
    //APP_ERROR_CHECK(err_code);
		uart_init();
		scheduler_init();
	
		nrf_gpio_cfg_output(20);
		nrf_gpio_pin_write(20,1);	
	
		nrf_gpio_cfg_output(LED_PIN);
		nrf_gpio_pin_write(LED_PIN,0);	
//	 /* 1-channel PWM, 200Hz*/
//    app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_1CH(90000000L, LED_PIN);
//	/* Switch the polarity of the second channel. */
//    pwm1_cfg.pin_polarity[1] = APP_PWM_POLARITY_ACTIVE_HIGH;//APP_PWM_POLARITY_ACTIVE_HIGH;
//	
//		err_code = app_pwm_init(&PWM1,&pwm1_cfg,pwm_ready_callback);
//    APP_ERROR_CHECK(err_code);
//    app_pwm_enable(&PWM1);
//	
//		ready_flag = false;
//		while (app_pwm_channel_duty_set(&PWM1, 0, 90) == NRF_ERROR_BUSY);
//		while (!ready_flag);
//					APP_ERROR_CHECK(app_pwm_channel_duty_set(&PWM1, 1, 90));
					
		//app_pwm_uninit(&PWM1);
		 
		adc_config();
		timers_init();
		ble_stack_init();
		advertising_init();

    // Start execution.
    NRF_LOG_INFO("BLE Beacon started\r\n");
		application_timers_start();
    advertising_start();
		
		scan_start();

    // Enter main loop.
    for (;; )
    {	
				app_sched_execute();
			
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
